var state = [
    {
        "id": "0",
        "data": "北京市"
    },
    {
        "id": "1",
        "data": "天津市"
    },
    {
        "id": "2",
        "data": "上海市"
    },
    {
        "id": "3",
        "data": "重庆市"
    },
    {
        "id": "4",
        "data": "河北省"
    }
]


var city = {
	"city_0": [
        {
			"id": "1",
			"data": "东城区"
    	},
		{
			"id": "2",
			"data": "西城区"
    	},
		{
			"id": "3",
			"data": "崇文区"
    	},
		{
			"id": "4",
			"data": "宣武区"
    	},
		{
			"id": "5",
			"data": "朝阳区"
    	},
		{
			"id": "6",
			"data": "丰台区"
    	},
		{
			"id": "7",
			"data": "石景山区"
    	},
		{
			"id": "8",
			"data": "海淀区"
    	},
		{
			"id": "9",
			"data": "通州区"
    	},
		{
			"id": "10",
			"data": "门头沟区"
    	},
		{
			"id": "11",
			"data": "房山区"
    	},
		{
			"id": "12",
			"data": "顺义区"
    	},
		{
			"id": "13",
			"data": "昌平区"
    	},
		{
			"id": "14",
			"data": "大兴区"
    	},
		{
			"id": "15",
			"data": "延庆镇"
    	},
		{
			"id": "16",
			"data": "怀柔区"
    	},
		{
			"id": "17",
			"data": "平谷区"
    	},
		{
			"id": "18",
			"data": "密云县"
    	},
		{
			"id": "19",
			"data": "延庆县"
    	}
		
    ],
	"city_1": [
        {
			"id": "356",
			"data": "和平区"
    	},
		{
			"id": "357",
			"data": "河东区"
    	},
		{
			"id": "358",
			"data": "河西区"
    	},
		{
			"id": "356",
			"data": "南开区"
    	},
		{
			"id": "357",
			"data": "河北区"
    	},
		{
			"id": "358",
			"data": "红桥区"
    	},
		{
			"id": "356",
			"data": "塘沽区"
    	},
		{
			"id": "357",
			"data": "汉沽区"
    	},
		{
			"id": "358",
			"data": "大港区"
    	},
		{
			"id": "356",
			"data": "东丽区"
    	},
		{
			"id": "357",
			"data": "北辰区"
    	},
		{
			"id": "358",
			"data": "津南区"
    	}
    ],
	"city_2": [
        {
			"id": "356",
			"data": "嘉定区"
    	},
		{
			"id": "357",
			"data": "宝山区"
    	},
		{
			"id": "358",
			"data": "闵行区"
    	},
		{
			"id": "356",
			"data": "杨浦区"
    	},
		{
			"id": "357",
			"data": "虹口区"
    	},
		{
			"id": "358",
			"data": "闸北区"
    	},
		{
			"id": "356",
			"data": "普陀区"
    	},
		{
			"id": "357",
			"data": "静安区"
    	},
		{
			"id": "358",
			"data": "长宁区"
    	},
		{
			"id": "356",
			"data": "徐汇区"
    	},
		{
			"id": "357",
			"data": "卢湾区"
    	},
		{
			"id": "358",
			"data": "黄浦区"
    	}
    ],
	"city_3": [
        {
			"id": "356",
			"data": "黔江区"
    	},
		{
			"id": "357",
			"data": "涪陵区"
    	},
		{
			"id": "358",
			"data": "万州区"
    	},
		{
			"id": "356",
			"data": "巴南区"
    	},
		{
			"id": "357",
			"data": "渝北区"
    	},
		{
			"id": "358",
			"data": "双桥区"
    	},
		{
			"id": "356",
			"data": "北碚区"
    	},
		{
			"id": "357",
			"data": "九龙坡区"
    	},
		{
			"id": "358",
			"data": "沙坪坝区"
    	},
		{
			"id": "356",
			"data": "江北区"
    	},
		{
			"id": "357",
			"data": "大渡口区"
    	},
		{
			"id": "358",
			"data": "渝中区"
    	}
    ],
	"city_4": [
        {
			"id": "356",
			"data": "桥东区"
    	},
		{
			"id": "357",
			"data": "宣化区"
    	},
		{
			"id": "358",
			"data": "下花园区"
    	},
		{
			"id": "356",
			"data": "柴沟堡"
    	},
		{
			"id": "357",
			"data": "崇礼县"
    	},
		{
			"id": "358",
			"data": "赤城县"
    	},
		{
			"id": "356",
			"data": "涿鹿县"
    	},
		{
			"id": "357",
			"data": "怀来县"
    	},
		{
			"id": "358",
			"data": "孔家庄镇"
    	},
		{
			"id": "356",
			"data": "阳原县"
    	},
		{
			"id": "357",
			"data": "蔚州镇"
    	},
		{
			"id": "358",
			"data": "西湾子镇"
    	}
    ]
}